insert into foods(name)
values ('Овощной салат'), ('Творожные вафли'), ('Творог обезжиренный'),
       ('Яйцо'), ('Рисовая мука'), ('Молоко 2.5%'),
       ('Разрыхлитель теста'), ('Помидор'), ('Огурец');

insert into mealtime_types(name)
values ('Завтрак'), ('Обед'), ('Ужин'), ('Перекус');

insert into receipts(food_id, instruction)
values (1, '1) Нарезаем всё, кладём в тарелку и наслаждаемся'),
       (2, '1) Добавляем в миску яйца, молоко, творог и разрыхлитель и взбиваем. ' ||
           '2) Постепенно вмешиваем муку. ' ||
           '3) Полученную массу вливаем на вафельницу и жарим 7-10 минут');

insert into match_receipt_to_meal(receipt_id, mealtime_type_id)
values (1, 1), (1, 2), (1, 3), (2, 1);

insert into servings(name, food_id, calories, proteins, fats, carbohydrates)
values ('порция', 1, 67, 3.04, 0.58, 15.75),
       ('порция', 2, 348, 25.39, 10.6, 37.8),
       ('грамм', 3, 1.01, 0.1801, 0.0184, 0.0334),
       ('штука', 4, 65, 5.54, 4.37, 0.34),
       ('грамм', 5, 3.5, 0.07, 0.01, 0.79),
       ('мл', 6, 0.53, 0.03, 0.025, 0.047),
       ('грамм', 7, 0.23, 0.03, 0.005, 0.53),
       ('грамм', 8, 0.0018, 0.0088, 0.002, 0.0392),
       ('грамм', 9, 0.15, 0.0065, 0.0011, 0.0363);

insert into ingredient(receipt_id, serving_id, quantity)
values (1, 8, 300),
       (1, 9, 300),
       (2, 3, 100),
       (2, 4, 1),
       (2, 5, 80),
       (2, 6, 60),
       (2, 7, 5);
